{
   "article": "<h3>Article</h3><br><p>Элемент статьи представляет собой полную или самостоятельную композицию в документе, странице, приложении или сайте и, в принципе, может распространяться независимо или повторно использоваться, например в синдикации. Это может быть сообщение на форуме, статья в журнале или газете, запись в блоге, комментарий пользователя, интерактивный виджет или гаджет или любой другой независимый элемент контента.<br><br>Когда элементы статьи вложены, внутренние элементы статьи представляют статьи, которые в принципе связаны с содержимым внешней статьи. Например, запись в блоге на сайте, который принимает комментарии, отправленные пользователями, может представлять комментарии как элементы статьи, вложенные в элемент статьи для записи блога.<br><br>Информация об авторе, связанная с элементом статьи, не применяется к вложенным элементам статьи.</p>",
   "section": "<h3>Section</h3><br><p>Элемент раздела представляет собой общий раздел документа или приложения. В данном контексте раздел представляет собой тематическую группу контента, обычно с заголовком.</p>",
   "nav": "<h3>Nav</h3><br><p>Элемент nav представляет собой раздел страницы, который ссылается на другие страницы или части страницы: раздел с навигационными ссылками.</p>",
   "aside": "<h3>Aside</h3><br><p>Элемент «side» представляет собой раздел страницы, состоящий из содержимого, которое косвенно связано с содержимым вокруг элемента «side», и которое можно считать отдельным от этого содержимого. Такие разделы часто представлены в виде боковых панелей в печатной типографике.<br><br>Этот элемент можно использовать для типографских эффектов, таких как цитаты или боковые панели, для рекламы, для групп элементов навигации и для другого контента, который считается отдельным от основного содержимого страницы.</p>",
   "h": "<h3>Заголовки h</h3><br><p>Эти элементы представляют собой заголовки своих разделов.<br><br>Семантика и значение этих элементов определены в разделе «Заголовки и контуры».<br><br>Эти элементы имеют уровень заголовка, определяемый числом в их названии. Уровень заголовка соответствует уровням вложенных разделов. Элемент h1 предназначен для раздела верхнего уровня, h2 — для подраздела, h3 — для подраздела и т. д.<br>Пример:<h1>Это h1</h1><h2>Это h2</h2><h3>Это h3</h3><h4>Это h4</h4><h5>Это h5</h5><h6>Это h6</h6></p>",
   "hgroup": "<h3>Hgroup</h3><br><p>Элемент hgroup представляет заголовок и связанное с ним содержимое. Этот элемент можно использовать для группировки элемента h1–h6 с одним или несколькими элементами p, содержащими контент, представляющий подзаголовок, альтернативный заголовок или слоган.</p>",
   "header": "<h3>Header</h3><br><p>Элемент заголовка представляет собой группу вводных или навигационных средств.</p>",
   "footer": "<h3>Footer</h3><br><p>Элемент нижнего колонтитула представляет собой нижний колонтитул для элемента содержимого раздела ближайшего предка или для элемента body, если такого предка нет. Нижний колонтитул обычно содержит информацию о своем разделе, например, кто его написал, ссылки на соответствующие документы, данные об авторских правах и тому подобное.<br><br>Когда элемент нижнего колонтитула содержит целые разделы, они представляют собой приложения, указатели, длинные колофоны, подробные лицензионные соглашения и другой подобный контент.<br><br>Нижние колонтитулы не обязательно должны располагаться в конце раздела, хотя обычно они появляются.<br><br>Если элемент содержимого раздела-предка отсутствует, он применяется ко всей странице.<p>",
   "address": "<h3>Address</h3><br><p>Элемент адреса представляет контактную информацию для ближайшей статьи или предка элемента тела. Если это элемент body, то контактная информация применяется ко всему документу в целом.</p>",
   "p": "p - Абзац текста",
   "hr": "<h3>Hr</h3><br><p>элемент hr представляет собой тематический разрыв на уровне абзаца, например, смену сцены в рассказе или переход к другой теме в разделе справочника; альтернативно, он представляет собой разделитель между набором опций элемента выбора.</p>",
   "pre": "<h3>Pre</h3><br><p>Элемент pre представляет собой блок предварительно отформатированного текста, структура которого представлена ​​типографскими соглашениями, а не элементами.<br><br>Некоторые примеры случаев, когда можно использовать элемент pre:</p><br><ul><li>Включая электронную почту, в которой абзацы обозначаются пустыми строками, списки обозначаются строками с маркером и т. д.</li><li>Включая фрагменты компьютерного кода со структурой, указанной в соответствии с соглашениями этого языка.</li><li>Отображение ASCII-арта.</li></ul><br><p>Чтобы представить блок компьютерного кода, элемент pre может использоваться с элементом кода; для представления блока компьютерного вывода элемент pre может использоваться с элементом samp. Аналогично, элемент kbd может использоваться внутри элемента pre для обозначения текста, который должен ввести пользователь.</p></ul>",
   "blockquote": "<h3>Blockquote</h3><br><p>Элемент blockquote представляет раздел, цитируемый из другого источника.<br><br>Содержимое внутри цитаты должно быть цитировано из другого источника, адрес которого, если он есть, может быть указан в атрибуте cite.<br><br>Если атрибут cite присутствует, это должен быть действительный URL-адрес, потенциально окруженный пробелами. Чтобы получить соответствующую ссылку на цитирование, значение атрибута необходимо проанализировать относительно узла документа элемента. Пользовательские агенты могут позволять пользователям переходить по таким ссылкам на цитирование, но они в первую очередь предназначены для частного использования (например, серверными сценариями, собирающими статистику об использовании цитат на сайте), а не для читателей.<br><br>Содержимое цитаты может быть сокращено или может иметь добавленный контекст обычным способом для языка текста.</p><br><blockquote><p>blocjquote - указывает на то, что заключённый в нем текст является развёрнутой цитатой.</p></blockquote><p>-Развернутая цитата</p>",
   "ul": "<h3>Ul</h3><br><ul><li>ul - то неупорядоченный список</li><li>ul - то неупорядоченный список</li><li>ul - то неупорядоченный список</li></ul>",
   "ol": "<h3>Ol</h3><br><ol><li>ol - то упорядоченный список</li><li>ol - то упорядоченный список</li><li>ol - то упорядоченный список</li></ol>",
   "li": "<h3>Li</h3><br><p>li - элемент списка</p>",
   "menu": "<h3>Menu</h3><br><p>menu - предназначен для отображения списка пунктов меню</p><menu><li>Пункт меню</li><li>Пункт меню</li><li>Пункт меню</li></menu>",
   "dl": "<h3>Dl</h3><br><p>Элемент dl представляет список ассоциаций, состоящий из нуля или более групп «имя-значение» (список описаний). Группа имя-значение состоит из одного или нескольких имен (элементы dt, возможно, как дочерние элементы дочернего элемента div), за которыми следуют одно или несколько значений (элементы dd, возможно, как дочерние элементы дочернего элемента div), игнорируя любые узлы, кроме dt. и дочерние элементы dd, а также элементы dt и dd, которые являются дочерними элементами дочерних элементов div. В одном элементе dl не должно быть более одного элемента dt для каждого имени.<br><br>Группы значений имени могут представлять собой термины и определения, темы и значения метаданных, вопросы и ответы или любые другие группы данных значения имени.<br><br>Ценности внутри группы являются альтернативными; несколько абзацев, составляющих часть одного и того же значения, должны быть заданы в одном и том же элементе dd.<br><br>Порядок списка групп, а также имен и значений внутри каждой группы может иметь важное значение.<br><br>Чтобы аннотировать группы атрибутами микроданных или другими глобальными атрибутами, применимыми к целым группам, или просто в целях стилизации, каждую группу в элементе dl можно обернуть элементом div. Это не меняет семантику элемента dl.</p>",
   "dt": "<h3>Dt</h3><br><p>Элемент dt представляет термин или имя, часть группы описаний терминов в списке описаний (элемент dl).</p>",
   "dd": "<h3>Dd<br><p>Элемент dd представляет описание, определение или значение, часть группы описаний терминов в списке описаний (элемент dl).</p>",
   "figure": "<p>figure - Используется для группирования любых элементов, например, изображений и подписей к ним</p><figure><img src='https://img.freepik.com/free-photo/close-up-on-adorable-kitten-indoors_23-2150782423.jpg'><figcaption>Тег figcaption - используется для подписи группирования пар элементов</figcaption></figure>",
   "figcaption":  "<p>figcaption - используется для подписи группирования пар элементов</p><figure><img src='https://img.freepik.com/free-photo/close-up-on-adorable-kitten-indoors_23-2150782423.jpg'><figcaption>Тег figcaption - используется для подписи группирования пар элементов</figcaption></figure>",
   "main": "<h3>Main</h3><br><p>Главный элемент представляет доминирующее содержимое документа.<br><br>В документе не должно быть более одного основного элемента, для которого не указан атрибут скрытый.<br><br>Иерархически правильный главный элемент — это тот, чьи родительские элементы ограничены html, body, div, формой без доступного имени и автономными пользовательскими элементами. Каждый главный элемент должен быть иерархически правильным главным элементом.</p>",
   "search": "<h3>Search</h3><br><p>Элемент поиска представляет собой часть документа или приложения, содержащую набор элементов управления формой или другой контент, связанный с выполнением операции поиска или фильтрации. Это может быть поиск по веб-сайту или приложению; способ поиска или фильтрации результатов поиска на текущей веб-странице; или глобальная функция поиска или поиск по всему Интернету.</p>",
   "div": "<h3>Div</h3><br><p>Элемент div вообще не имеет особого значения. Он представляет своих детей. Его можно использовать с атрибутами class, lang и title для разметки семантики, общей для группы последовательных элементов. Его также можно использовать в элементе dl, обертывая группы элементов dt и dd.</p>",
   "a": "<h3>A</h3><br><a href='https://www.google.com/'>a - определяет гиперссылку</a>",
   "em": "<h3>Em</h3><br><em>em - предназначен для слов, которые имеют подчёркнутый акцент по сравнению с окружающим текстом</em>",
   "strong": "<h3>Strong</h3><br><strong>strong - указывает на то, что его содержание имеет большое значение, серьёзность или срочность</strong>",
   "small": "<h3>Small</h3><br><small>small -  уменьшает размер шрифта на единицу по сравнению с обычным текстом</small>",
   "s": "<h3>S</h3><br><s>s - отображает текст как перечеркнутый</s>",
   "cite": "<h3>Cite</h3><br><cite>cite - представляет из себя ссылку на источник цитаты</cite>",
   "q": "<h3>Q</h3><br><q>q - используется для выделения в тексте цитат</q>",
   "dfn": "<h3DFN</h3><br><dfn>dfn - используется для указания термина, определяемого в контексте фразы или предложения</dfn>",
   "abbr": "<h3>Abbr</h3><br><p>abbr - указывает, что последовательность символов является аббревиатурой</p><p><abbr title='Common Gateway Interface, общий шлюзовый интерфейс'>CGI</abbr>обозначается протокол, с помощью которого любые внешние программы взаимодействуют с веб-сервером.</p>",
   "ruby": "<h3>Ruby</h3><p>ruby - предназначен для добавления небольшой аннотации сверху или снизу от заданного текста.<br>Такая форма записи преимущественно используется для идеографической письменности вроде китайского языка, но может применяться и для других языков, если требуется написать один текст над другим.</p>",
   "rt": "<h3>Rt</h3><br><p>Сам тег ruby выступает контейнером для тега rt, он и формирует аннотацию к тексту, после которого идет; а также rp, этот тег предназначен для браузеров, которые не поддерживают ruby.</p><ruby>漢<rt>かん</rt>字<rt>じ</rt></ruby>",
   "rp": "<h3>Rp</h3><br><p>Сам тег ruby выступает контейнером для тега rt, он и формирует аннотацию к тексту, после которого идет; а также rp, этот тег предназначен для браузеров, которые не поддерживают ruby.</p><ruby>漢<rt>かん</rt>字<rt>じ</rt></ruby>",
   "data": "<h3>Data</h3><br><p>data - отображает заданное значение в машиночитаемом формате. Он часто используется в сочетании с другими тегами для более удобного представления числовых или статистических данных.</p>",
   "time": "<h3>Time</h3><br><p>time - помечает текст внутри тега как дата, время или оба значения</p><p><time>1957-10-04</time> запущен первый искусственный спутник Земли.</p>",
   "code": "<h3>Code</h3><br><p>code - используется для отображения кода (скрипта)</p><code>print('Hello world!')</code>",
   "var": "<h3>Var</h3><br><p>var - используется для выделения переменных компьютерных программ</p><p>В данном примере делается запрос к базе данных для получения поля <var>content_title</var></p",
   "samp": "<h3>Samp</h3><br><p>samp - используется для отображения текста, который является результатом вывода компьютерной программы или скрипта</p><samp>Ваш браузер поддерживает JavaScript 1.3</samp>",
   "kbd": "<h3>Kbd</h3><br><p>kbd - используется для обозначения текста, который набирается на клавиатуре или для названия клавиш</p><kbd>&lt;Alt&gt;+&lt;Backspace&gt;</kbd>",
   "sub": "<h3>Sub</h3><br><p>sub - отображает текст в виде нижнего индекса</p><p>e<sub>2</sub></p>",
   "sup": "<h3>Sup</h3><br><p>sup - отображает текст в виде вверхнего индекса</p><p>e<sup>x2</sup></p>",
   "i": "<h3>I</h3><br><i>i - устанавливает курсивное начертание шрифта</i>",
   "b": "<h3>B</h3><br><b>b - устанавливает жирное начертание шрифта</b>",
   "u": "<h3>U</h3><br><u>u - добавляет подчеркивание к тексту</u>",
   "mark": "<h3>Mark</h3><br><mark>mark - помечает текст как выделенный</mark>",
   "bdi": "<h3>Bdi</h3><br><bdi>bdi - указывает фрагмент текста, который должен быть изолирован от изменения направления вывода текста</bdi>",
   "bdo": "<h3>Bdo</h3><br><bdo>bdo - устанавливает направление вывода текста и преимущественно предназначен для использования с языками, где чтение происходит справа налево</bdo>",
   "span": "<h3>Span</h3><br><span>span - тег для выделения текста</span>",
   "br": "<h3>Br</h3><br><p>br - отвечает за переход<br> на новую строку</p>",
   "wbr": "<h3>Wbr</h3><br><p>wbr - указывает браузеру место, где допускается делать перенос строки в тексте, если этого требует ширина родительского элемента</p>",
   "ins": "<h3>Ins</h3><br><ins>ins - предназначен для выделения текста, который был добавлен в новую версию документа. Подобное форматирование позволяет отследить, какие изменения в тексте документа были сделаны</ins>",
   "del": "<h3>Del</h3><br><del>del - используется для выделения текста, который был удален в новой версии документа</del>",
   "picture": "<h3>Picture</h3><br><p>Элемент изображения — это контейнер, который предоставляет несколько источников для содержащегося в нем элемента img, что позволяет авторам декларативно контролировать или давать подсказки пользовательскому агенту о том, какой ресурс изображения использовать, на основе плотности пикселей экрана, размера области просмотра, формата изображения и других факторов. факторы. Он представляет своих детей.</p>",
   "source": "<h3>Source</h3><br><p>Элемент source позволяет авторам указывать несколько альтернативных наборов источников для элементов img или несколько альтернативных медиа-ресурсов для медиа-элементов. Само по себе оно ничего не представляет.<br><br>Атрибут type может присутствовать. Если оно присутствует, значение должно быть допустимой строкой типа MIME.<br><br>Атрибут media также может присутствовать. Если оно присутствует, значение должно содержать действительный список медиа-запросов. Пользовательский агент перейдет к следующему исходному элементу, если значение не соответствует среде.</p>",
   "img": "<h3>Img</h3><br><p>Элемент img представляет изображение.<br><br>Элемент img имеет источник атрибута измерения, изначально установленный для самого элемента.<br><br>Изображение, заданное атрибутами src и srcset, а также атрибутами srcset любых предыдущих родственных исходных элементов, если родительским элементом является элемент изображения, является внедренным содержимым; значение атрибута alt предоставляет эквивалентный контент для тех, кто не может обрабатывать изображения или у кого отключена загрузка изображений (т. е. это резервный контент элемента img).<br><br>Требования к значению атрибута alt описаны в отдельном разделе.<br><br>Атрибут src должен присутствовать и содержать допустимый непустой URL-адрес, потенциально окруженный пробелами, ссылающийся на неинтерактивный, опционально анимированный ресурс изображения, который не является ни страничным, ни сценарным.</p>",
   "iframe": "<h3>iframe</h3><br><p>iframe - создает плавающий фрейм, который находится внутри обычного документа, он позволяет загружать в область заданных размеров любые другие независимые документы</p>",
   "embed": "<h3>Embed</h3><br><p>embed - используется для загрузки и отображения объектов (например, видеофайлов, флэш-роликов, некоторых звуковых файлов и т.д.), которые исходно браузер не понимает.<br> Как правило, такие объекты требуют подключения к браузеру специального модуля, который называется плагин, или запуска вспомогательной программы</p>",
   "object":  "<h3>Object</h3><br><p>object - сообщает браузеру, как загружать и отображать объекты, которые исходно браузер не понимает.<br>Как правило, такие объекты требуют подключения к браузеру специального модуля, который называется плагин, или запуска вспомогательной программы</p>",
   "video": "<h3>Video</h3><br><p>video - отвечает за отображение видео-файла</p>",
   "audio": "<h3>Audio</h3><br><p>audio - отвечает за отображение аудио-файла</p>",
   "track": "<h3>Track</h3><br><p>track - позволяет авторам указать текстовую дорожку для медийных элементов audio и video</p>",
   "map": "<h3>Map</h3><br><p>map - служит контейнером для элементов area, которые определяют активные области для карт-изображений</p>",
   "area": "<h3>Area</h3><br><p>area - задает форму области, ее размеры, устанавливает адрес документа, на который следует сделать ссылку, а также имя окна или фрейма, куда браузер будет загружать документ.</p>",
   "table": "<h3>Table</h3><br><p>table - отвечает за создание таблицы</p>",
   "caption": "<h3>Caption</h3><br><p>caption - предназначен для заголовка таблицы</p><table><caption>Заголовок таблицы</caption><tr><td>Элемент таблицы</td><td>Элемент таблицы</td></tr><tr><td>Элемент таблицы</td><td>Элемент таблицы</td></tr></table>",
   "colgroup": "<h3>Colgroup</h3><br><p>colgroup - предназначен для задания ширины и стиля одной или нескольких колонок таблицы</p>",
   "col": "<h3>Col</h3><br><p>col - задает группу колонок, обладающх общими характеристиками</p>",
   "tbody": "<h3>Tbody</h3><br><p>tbody - предназначен для хранения одной или нескольких строк в теле таблицы.<br>Это позволяет создавать структурные блоки.</p><table><tbody><tr><td>Элемент таблицы</td><td>Элемент таблицы</td></tr></tbody></table>",
   "thead": "<h3>Thead</h3><br><p>thead - предназначен для хранения одной или нескольких строк, которые представлены вверху таблицы.<br>Допустимо использовать не более одного элемента thead.</p><table style='width: 600px'><thead style='background: #fc0'><tr><td>Thead</td><td>Thead</td></tr></thead><tbody style='background: #ccc'><tr><td>Tbody</td><td>Tbody</td></tr></tbody></table>",
   "tfoot": "<h3>Tfoot</h3><br><p>tfoot - предназначен для хранения одной или нескольких строк, которые представлены внизу таблицы</p><table style='width: 600px'><thead style='background: #fc0'><tr><td>Thead</td><td>Thead</td></tr></thead><tbody style='background: #ccc'><tr><td>Tbody</td><td>Tbody</td></tr></tbody><tfoot style='background: silver'><tr><td>Tfoot</td><td>Tfoot</td></tr></tfoot></table>",
   "tr": "<h3>Tr</h3><br><p>tr - представляет собой строку таблицы</p>",
   "td": "<h3>Td</h3><br><p>td - представяет собой элемент таблицы</p>",
   "th": "<h3>Th</h3><br><p>th - предназначен для создания одной ячейки таблицы, которая обозначается как заголовочная</p>",
   "form": "<h3>Form</h3><br><p>form - устанавливает форму на веб-странице. Форма предназначена для обмена данных между клиентом и сервером</p>",
   "label": "<h3>Label</h3><br><p>label - устанавливает связь между определенной меткой, в качестве которой обычно выступает текст, и элементом формы (input, select, area)</p><form><input id='index'><label for='index'>Это label</label></form>",
   "inputText": "<h3>Type='text'</h3><br><p>Если элемент является изменяемым, его значение должно быть доступно для редактирования пользователем. Пользовательские агенты не должны позволять пользователям вставлять символы U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR) в значение элемента.<br><br>Если элемент является изменяемым, пользовательский агент должен разрешить пользователю изменять направление письма элемента, устанавливая для него либо направление письма слева направо, либо направление письма справа налево. Если пользователь это сделает, пользовательский агент должен выполнить следующие шаги:</p><br><br><ul><li>Установите для атрибута dir элемента значение «ltr», если пользователь выбрал направление письма слева направо, и «rtl», если пользователь выбрал направление письма справа налево.</li><li>Поставьте задачу элемента в очередь источника задачи взаимодействия с пользователем, заданного элементом, для запуска события с именем input в элементе, при этом пузырьки и составленные атрибуты инициализируются как true.</li><li>Атрибут value, если он указан, должен иметь значение, не содержащее символов U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR).</li></ul><br><br><form><input type='text' placeholder='Введите текст'></form>",
   "inputTel": "<h3>Type='tel'</h3><br><p>Элемент ввода представляет собой элемент управления для редактирования номера телефона, указанного в значении элемента.<br><br>Если элемент является изменяемым, его значение должно быть доступно для редактирования пользователем. Пользовательские агенты могут изменять интервалы и, при необходимости, пунктуацию значений, которые вводит пользователь. Пользовательские агенты не должны позволять пользователям вставлять символы U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR) в значение элемента.<br><br>Атрибут value, если он указан, должен иметь значение, не содержащее символов U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR).<br><br>Алгоритм очистки значения следующий: удалите из значения символы новой строки.</p><br><form><input type='tel'></form>'",
   "inputEmail": "",
   "inputDate": "<form><p>type=date</p><input type='date'><p>type=month</p><input type='month'><p>type=week</p><input type='week'><p>type=time</p><input type='time'><p>type=datetime-local</p><input type='datetime-local'></form>",
   "inputMonth": "",
   "inputWeek": "",
   "inputTime": "",
   "inputDateTime-Local": "",
   "inputNumber": "<form><p>type=number</p><input type='number'><p>type=range</p>20<input type='range'>120</form>",
   "inputRange": "",
   "inputColor": "<form><p>type=color</p><input type='color'></form>",
   "inputRadio": "<form><p>type=radio</p><input type='radio'>Значение<p>type=checkbox</p><input type='checkbox'>Галочка</form>",
   "inputCheckBox": "",
   "inputFile": "",
   "inputSubmit": "",
   "inputImage": "",
   "inputReset": "",
   "inputButton": "",
   "button": "",
   "select": "",
   "datalist": "",
   "optgroup": "",
   "option": "",
   "textarea": "",
   "progress": "",
   "meter": "",
   "fieldset": ""
}