{
   "article": "<h3>Article</h3><br><p>Элемент статьи представляет собой полную или самостоятельную композицию в документе, странице, приложении или сайте и, в принципе, может распространяться независимо или повторно использоваться, например в синдикации. Это может быть сообщение на форуме, статья в журнале или газете, запись в блоге, комментарий пользователя, интерактивный виджет или гаджет или любой другой независимый элемент контента.<br><br>Когда элементы статьи вложены, внутренние элементы статьи представляют статьи, которые в принципе связаны с содержимым внешней статьи. Например, запись в блоге на сайте, который принимает комментарии, отправленные пользователями, может представлять комментарии как элементы статьи, вложенные в элемент статьи для записи блога.<br><br>Информация об авторе, связанная с элементом статьи, не применяется к вложенным элементам статьи.</p>",
   "section": "<h3>Section</h3><br><p>Элемент раздела представляет собой общий раздел документа или приложения. В данном контексте раздел представляет собой тематическую группу контента, обычно с заголовком.</p>",
   "nav": "<h3>Nav</h3><br><p>Элемент nav представляет собой раздел страницы, который ссылается на другие страницы или части страницы: раздел с навигационными ссылками.</p>",
   "aside": "<h3>Aside</h3><br><p>Элемент «side» представляет собой раздел страницы, состоящий из содержимого, которое косвенно связано с содержимым вокруг элемента «side», и которое можно считать отдельным от этого содержимого. Такие разделы часто представлены в виде боковых панелей в печатной типографике.<br><br>Этот элемент можно использовать для типографских эффектов, таких как цитаты или боковые панели, для рекламы, для групп элементов навигации и для другого контента, который считается отдельным от основного содержимого страницы.</p>",
   "h": "<h3>Заголовки h</h3><br><p>Эти элементы представляют собой заголовки своих разделов.<br><br>Семантика и значение этих элементов определены в разделе «Заголовки и контуры».<br><br>Эти элементы имеют уровень заголовка, определяемый числом в их названии. Уровень заголовка соответствует уровням вложенных разделов. Элемент h1 предназначен для раздела верхнего уровня, h2 — для подраздела, h3 — для подраздела и т. д.<br>Пример:<h1>Это h1</h1><h2>Это h2</h2><h3>Это h3</h3><h4>Это h4</h4><h5>Это h5</h5><h6>Это h6</h6></p>",
   "hgroup": "<h3>Hgroup</h3><br><p>Элемент hgroup представляет заголовок и связанное с ним содержимое. Этот элемент можно использовать для группировки элемента h1–h6 с одним или несколькими элементами p, содержащими контент, представляющий подзаголовок, альтернативный заголовок или слоган.</p>",
   "header": "<h3>Header</h3><br><p>Элемент заголовка представляет собой группу вводных или навигационных средств.</p>",
   "footer": "<h3>Footer</h3><br><p>Элемент нижнего колонтитула представляет собой нижний колонтитул для элемента содержимого раздела ближайшего предка или для элемента body, если такого предка нет. Нижний колонтитул обычно содержит информацию о своем разделе, например, кто его написал, ссылки на соответствующие документы, данные об авторских правах и тому подобное.<br><br>Когда элемент нижнего колонтитула содержит целые разделы, они представляют собой приложения, указатели, длинные колофоны, подробные лицензионные соглашения и другой подобный контент.<br><br>Нижние колонтитулы не обязательно должны располагаться в конце раздела, хотя обычно они появляются.<br><br>Если элемент содержимого раздела-предка отсутствует, он применяется ко всей странице.<p>",
   "address": "<h3>Address</h3><br><p>Элемент адреса представляет контактную информацию для ближайшей статьи или предка элемента тела. Если это элемент body, то контактная информация применяется ко всему документу в целом.</p>",
   "p": "p - Абзац текста",
   "hr": "<h3>Hr</h3><br><p>элемент hr представляет собой тематический разрыв на уровне абзаца, например, смену сцены в рассказе или переход к другой теме в разделе справочника; альтернативно, он представляет собой разделитель между набором опций элемента выбора.</p>",
   "pre": "<h3>Pre</h3><br><p>Элемент pre представляет собой блок предварительно отформатированного текста, структура которого представлена ​​типографскими соглашениями, а не элементами.<br><br>Некоторые примеры случаев, когда можно использовать элемент pre:</p><br><ul><li>Включая электронную почту, в которой абзацы обозначаются пустыми строками, списки обозначаются строками с маркером и т. д.</li><li>Включая фрагменты компьютерного кода со структурой, указанной в соответствии с соглашениями этого языка.</li><li>Отображение ASCII-арта.</li></ul><br><p>Чтобы представить блок компьютерного кода, элемент pre может использоваться с элементом кода; для представления блока компьютерного вывода элемент pre может использоваться с элементом samp. Аналогично, элемент kbd может использоваться внутри элемента pre для обозначения текста, который должен ввести пользователь.</p></ul>",
   "blockquote": "<h3>Blockquote</h3><br><p>Элемент blockquote представляет раздел, цитируемый из другого источника.<br><br>Содержимое внутри цитаты должно быть цитировано из другого источника, адрес которого, если он есть, может быть указан в атрибуте cite.<br><br>Если атрибут cite присутствует, это должен быть действительный URL-адрес, потенциально окруженный пробелами. Чтобы получить соответствующую ссылку на цитирование, значение атрибута необходимо проанализировать относительно узла документа элемента. Пользовательские агенты могут позволять пользователям переходить по таким ссылкам на цитирование, но они в первую очередь предназначены для частного использования (например, серверными сценариями, собирающими статистику об использовании цитат на сайте), а не для читателей.<br><br>Содержимое цитаты может быть сокращено или может иметь добавленный контекст обычным способом для языка текста.</p><br><blockquote><p>blocjquote - указывает на то, что заключённый в нем текст является развёрнутой цитатой.</p></blockquote><p>-Развернутая цитата</p>",
   "ul": "<h3>Ul</h3><br><ul><li>ul - то неупорядоченный список</li><li>ul - то неупорядоченный список</li><li>ul - то неупорядоченный список</li></ul>",
   "ol": "<h3>Ol</h3><br><ol><li>ol - то упорядоченный список</li><li>ol - то упорядоченный список</li><li>ol - то упорядоченный список</li></ol>",
   "li": "<h3>Li</h3><br><p>li - элемент списка</p>",
   "menu": "<h3>Menu</h3><br><p>menu - предназначен для отображения списка пунктов меню</p><menu><li>Пункт меню</li><li>Пункт меню</li><li>Пункт меню</li></menu>",
   "dl": "<h3>Dl</h3><br><p>Элемент dl представляет список ассоциаций, состоящий из нуля или более групп «имя-значение» (список описаний). Группа имя-значение состоит из одного или нескольких имен (элементы dt, возможно, как дочерние элементы дочернего элемента div), за которыми следуют одно или несколько значений (элементы dd, возможно, как дочерние элементы дочернего элемента div), игнорируя любые узлы, кроме dt. и дочерние элементы dd, а также элементы dt и dd, которые являются дочерними элементами дочерних элементов div. В одном элементе dl не должно быть более одного элемента dt для каждого имени.<br><br>Группы значений имени могут представлять собой термины и определения, темы и значения метаданных, вопросы и ответы или любые другие группы данных значения имени.<br><br>Ценности внутри группы являются альтернативными; несколько абзацев, составляющих часть одного и того же значения, должны быть заданы в одном и том же элементе dd.<br><br>Порядок списка групп, а также имен и значений внутри каждой группы может иметь важное значение.<br><br>Чтобы аннотировать группы атрибутами микроданных или другими глобальными атрибутами, применимыми к целым группам, или просто в целях стилизации, каждую группу в элементе dl можно обернуть элементом div. Это не меняет семантику элемента dl.</p>",
   "dt": "<h3>Dt</h3><br><p>Элемент dt представляет термин или имя, часть группы описаний терминов в списке описаний (элемент dl).</p>",
   "dd": "<h3>Dd<br><p>Элемент dd представляет описание, определение или значение, часть группы описаний терминов в списке описаний (элемент dl).</p>",
   "figure": "<p>figure - Используется для группирования любых элементов, например, изображений и подписей к ним</p><figure><img src='https://img.freepik.com/free-photo/close-up-on-adorable-kitten-indoors_23-2150782423.jpg'><figcaption>Тег figcaption - используется для подписи группирования пар элементов</figcaption></figure>",
   "figcaption":  "<p>figcaption - используется для подписи группирования пар элементов</p><figure><img src='https://img.freepik.com/free-photo/close-up-on-adorable-kitten-indoors_23-2150782423.jpg'><figcaption>Тег figcaption - используется для подписи группирования пар элементов</figcaption></figure>",
   "main": "<h3>Main</h3><br><p>Главный элемент представляет доминирующее содержимое документа.<br><br>В документе не должно быть более одного основного элемента, для которого не указан атрибут скрытый.<br><br>Иерархически правильный главный элемент — это тот, чьи родительские элементы ограничены html, body, div, формой без доступного имени и автономными пользовательскими элементами. Каждый главный элемент должен быть иерархически правильным главным элементом.</p>",
   "search": "<h3>Search</h3><br><p>Элемент поиска представляет собой часть документа или приложения, содержащую набор элементов управления формой или другой контент, связанный с выполнением операции поиска или фильтрации. Это может быть поиск по веб-сайту или приложению; способ поиска или фильтрации результатов поиска на текущей веб-странице; или глобальная функция поиска или поиск по всему Интернету.</p>",
   "div": "<h3>Div</h3><br><p>Элемент div вообще не имеет особого значения. Он представляет своих детей. Его можно использовать с атрибутами class, lang и title для разметки семантики, общей для группы последовательных элементов. Его также можно использовать в элементе dl, обертывая группы элементов dt и dd.</p>",
   "a": "<h3>A</h3><br><a href='https://www.google.com/'>a - определяет гиперссылку</a>",
   "em": "<h3>Em</h3><br><em>em - предназначен для слов, которые имеют подчёркнутый акцент по сравнению с окружающим текстом</em>",
   "strong": "<h3>Strong</h3><br><strong>strong - указывает на то, что его содержание имеет большое значение, серьёзность или срочность</strong>",
   "small": "<h3>Small</h3><br><small>small -  уменьшает размер шрифта на единицу по сравнению с обычным текстом</small>",
   "s": "<h3>S</h3><br><s>s - отображает текст как перечеркнутый</s>",
   "cite": "<h3>Cite</h3><br><cite>cite - представляет из себя ссылку на источник цитаты</cite>",
   "q": "<h3>Q</h3><br><q>q - используется для выделения в тексте цитат</q>",
   "dfn": "<h3DFN</h3><br><dfn>dfn - используется для указания термина, определяемого в контексте фразы или предложения</dfn>",
   "abbr": "<h3>Abbr</h3><br><p>abbr - указывает, что последовательность символов является аббревиатурой</p><p><abbr title='Common Gateway Interface, общий шлюзовый интерфейс'>CGI</abbr>обозначается протокол, с помощью которого любые внешние программы взаимодействуют с веб-сервером.</p>",
   "ruby": "<h3>Ruby</h3><p>ruby - предназначен для добавления небольшой аннотации сверху или снизу от заданного текста.<br>Такая форма записи преимущественно используется для идеографической письменности вроде китайского языка, но может применяться и для других языков, если требуется написать один текст над другим.</p>",
   "rt": "<h3>Rt</h3><br><p>Сам тег ruby выступает контейнером для тега rt, он и формирует аннотацию к тексту, после которого идет; а также rp, этот тег предназначен для браузеров, которые не поддерживают ruby.</p><ruby>漢<rt>かん</rt>字<rt>じ</rt></ruby>",
   "rp": "<h3>Rp</h3><br><p>Сам тег ruby выступает контейнером для тега rt, он и формирует аннотацию к тексту, после которого идет; а также rp, этот тег предназначен для браузеров, которые не поддерживают ruby.</p><ruby>漢<rt>かん</rt>字<rt>じ</rt></ruby>",
   "data": "<h3>Data</h3><br><p>data - отображает заданное значение в машиночитаемом формате. Он часто используется в сочетании с другими тегами для более удобного представления числовых или статистических данных.</p>",
   "time": "<h3>Time</h3><br><p>time - помечает текст внутри тега как дата, время или оба значения</p><p><time>1957-10-04</time> запущен первый искусственный спутник Земли.</p>",
   "code": "<h3>Code</h3><br><p>code - используется для отображения кода (скрипта)</p><code>print('Hello world!')</code>",
   "var": "<h3>Var</h3><br><p>var - используется для выделения переменных компьютерных программ</p><p>В данном примере делается запрос к базе данных для получения поля <var>content_title</var></p",
   "samp": "<h3>Samp</h3><br><p>samp - используется для отображения текста, который является результатом вывода компьютерной программы или скрипта</p><samp>Ваш браузер поддерживает JavaScript 1.3</samp>",
   "kbd": "<h3>Kbd</h3><br><p>kbd - используется для обозначения текста, который набирается на клавиатуре или для названия клавиш</p><kbd>&lt;Alt&gt;+&lt;Backspace&gt;</kbd>",
   "sub": "<h3>Sub</h3><br><p>sub - отображает текст в виде нижнего индекса</p><p>e<sub>2</sub></p>",
   "sup": "<h3>Sup</h3><br><p>sup - отображает текст в виде вверхнего индекса</p><p>e<sup>x2</sup></p>",
   "i": "<h3>I</h3><br><i>i - устанавливает курсивное начертание шрифта</i>",
   "b": "<h3>B</h3><br><b>b - устанавливает жирное начертание шрифта</b>",
   "u": "<h3>U</h3><br><u>u - добавляет подчеркивание к тексту</u>",
   "mark": "<h3>Mark</h3><br><mark>mark - помечает текст как выделенный</mark>",
   "bdi": "<h3>Bdi</h3><br><bdi>bdi - указывает фрагмент текста, который должен быть изолирован от изменения направления вывода текста</bdi>",
   "bdo": "<h3>Bdo</h3><br><bdo>bdo - устанавливает направление вывода текста и преимущественно предназначен для использования с языками, где чтение происходит справа налево</bdo>",
   "span": "<h3>Span</h3><br><span>span - тег для выделения текста</span>",
   "br": "<h3>Br</h3><br><p>br - отвечает за переход<br> на новую строку</p>",
   "wbr": "<h3>Wbr</h3><br><p>wbr - указывает браузеру место, где допускается делать перенос строки в тексте, если этого требует ширина родительского элемента</p>",
   "ins": "<h3>Ins</h3><br><ins>ins - предназначен для выделения текста, который был добавлен в новую версию документа. Подобное форматирование позволяет отследить, какие изменения в тексте документа были сделаны</ins>",
   "del": "<h3>Del</h3><br><del>del - используется для выделения текста, который был удален в новой версии документа</del>",
   "picture": "<h3>Picture</h3><br><p>Элемент изображения — это контейнер, который предоставляет несколько источников для содержащегося в нем элемента img, что позволяет авторам декларативно контролировать или давать подсказки пользовательскому агенту о том, какой ресурс изображения использовать, на основе плотности пикселей экрана, размера области просмотра, формата изображения и других факторов. факторы. Он представляет своих детей.</p>",
   "source": "<h3>Source</h3><br><p>Элемент source позволяет авторам указывать несколько альтернативных наборов источников для элементов img или несколько альтернативных медиа-ресурсов для медиа-элементов. Само по себе оно ничего не представляет.<br><br>Атрибут type может присутствовать. Если оно присутствует, значение должно быть допустимой строкой типа MIME.<br><br>Атрибут media также может присутствовать. Если оно присутствует, значение должно содержать действительный список медиа-запросов. Пользовательский агент перейдет к следующему исходному элементу, если значение не соответствует среде.</p>",
   "img": "<h3>Img</h3><br><p>Элемент img представляет изображение.<br><br>Элемент img имеет источник атрибута измерения, изначально установленный для самого элемента.<br><br>Изображение, заданное атрибутами src и srcset, а также атрибутами srcset любых предыдущих родственных исходных элементов, если родительским элементом является элемент изображения, является внедренным содержимым; значение атрибута alt предоставляет эквивалентный контент для тех, кто не может обрабатывать изображения или у кого отключена загрузка изображений (т. е. это резервный контент элемента img).<br><br>Требования к значению атрибута alt описаны в отдельном разделе.<br><br>Атрибут src должен присутствовать и содержать допустимый непустой URL-адрес, потенциально окруженный пробелами, ссылающийся на неинтерактивный, опционально анимированный ресурс изображения, который не является ни страничным, ни сценарным.</p>",
   "iframe": "<h3>iframe</h3><br><p>iframe - создает плавающий фрейм, который находится внутри обычного документа, он позволяет загружать в область заданных размеров любые другие независимые документы</p>",
   "embed": "<h3>Embed</h3><br><p>embed - используется для загрузки и отображения объектов (например, видеофайлов, флэш-роликов, некоторых звуковых файлов и т.д.), которые исходно браузер не понимает.<br> Как правило, такие объекты требуют подключения к браузеру специального модуля, который называется плагин, или запуска вспомогательной программы</p>",
   "object":  "<h3>Object</h3><br><p>object - сообщает браузеру, как загружать и отображать объекты, которые исходно браузер не понимает.<br>Как правило, такие объекты требуют подключения к браузеру специального модуля, который называется плагин, или запуска вспомогательной программы</p>",
   "video": "<h3>Video</h3><br><p>video - отвечает за отображение видео-файла</p>",
   "audio": "<h3>Audio</h3><br><p>audio - отвечает за отображение аудио-файла</p>",
   "track": "<h3>Track</h3><br><p>track - позволяет авторам указать текстовую дорожку для медийных элементов audio и video</p>",
   "map": "<h3>Map</h3><br><p>map - служит контейнером для элементов area, которые определяют активные области для карт-изображений</p>",
   "area": "<h3>Area</h3><br><p>area - задает форму области, ее размеры, устанавливает адрес документа, на который следует сделать ссылку, а также имя окна или фрейма, куда браузер будет загружать документ.</p>",
   "table": "<h3>Table</h3><br><p>table - отвечает за создание таблицы</p>",
   "caption": "<h3>Caption</h3><br><p>caption - предназначен для заголовка таблицы</p><table><caption>Заголовок таблицы</caption><tr><td>Элемент таблицы</td><td>Элемент таблицы</td></tr><tr><td>Элемент таблицы</td><td>Элемент таблицы</td></tr></table>",
   "colgroup": "<h3>Colgroup</h3><br><p>colgroup - предназначен для задания ширины и стиля одной или нескольких колонок таблицы</p>",
   "col": "<h3>Col</h3><br><p>col - задает группу колонок, обладающх общими характеристиками</p>",
   "tbody": "<h3>Tbody</h3><br><p>tbody - предназначен для хранения одной или нескольких строк в теле таблицы.<br>Это позволяет создавать структурные блоки.</p><table><tbody><tr><td>Элемент таблицы</td><td>Элемент таблицы</td></tr></tbody></table>",
   "thead": "<h3>Thead</h3><br><p>thead - предназначен для хранения одной или нескольких строк, которые представлены вверху таблицы.<br>Допустимо использовать не более одного элемента thead.</p><table style='width: 600px'><thead style='background: #fc0'><tr><td>Thead</td><td>Thead</td></tr></thead><tbody style='background: #ccc'><tr><td>Tbody</td><td>Tbody</td></tr></tbody></table>",
   "tfoot": "<h3>Tfoot</h3><br><p>tfoot - предназначен для хранения одной или нескольких строк, которые представлены внизу таблицы</p><table style='width: 600px'><thead style='background: #fc0'><tr><td>Thead</td><td>Thead</td></tr></thead><tbody style='background: #ccc'><tr><td>Tbody</td><td>Tbody</td></tr></tbody><tfoot style='background: silver'><tr><td>Tfoot</td><td>Tfoot</td></tr></tfoot></table>",
   "tr": "<h3>Tr</h3><br><p>tr - представляет собой строку таблицы</p>",
   "td": "<h3>Td</h3><br><p>td - представяет собой элемент таблицы</p>",
   "th": "<h3>Th</h3><br><p>th - предназначен для создания одной ячейки таблицы, которая обозначается как заголовочная</p>",
   "form": "<h3>Form</h3><br><p>form - устанавливает форму на веб-странице. Форма предназначена для обмена данных между клиентом и сервером</p>",
   "label": "<h3>Label</h3><br><p>label - устанавливает связь между определенной меткой, в качестве которой обычно выступает текст, и элементом формы (input, select, area)</p><form><input id='index'><label for='index'>Это label</label></form>",
   "inputText": "<h3>Type='text'</h3><br><p>Если элемент является изменяемым, его значение должно быть доступно для редактирования пользователем. Пользовательские агенты не должны позволять пользователям вставлять символы U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR) в значение элемента.<br><br>Если элемент является изменяемым, пользовательский агент должен разрешить пользователю изменять направление письма элемента, устанавливая для него либо направление письма слева направо, либо направление письма справа налево. Если пользователь это сделает, пользовательский агент должен выполнить следующие шаги:</p><br><br><ul><li>Установите для атрибута dir элемента значение «ltr», если пользователь выбрал направление письма слева направо, и «rtl», если пользователь выбрал направление письма справа налево.</li><li>Поставьте задачу элемента в очередь источника задачи взаимодействия с пользователем, заданного элементом, для запуска события с именем input в элементе, при этом пузырьки и составленные атрибуты инициализируются как true.</li><li>Атрибут value, если он указан, должен иметь значение, не содержащее символов U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR).</li></ul><br><br><form><input type='text' placeholder='Введите текст'></form>",
   "inputTel": "<h3>Type='tel'</h3><br><p>Элемент ввода представляет собой элемент управления для редактирования номера телефона, указанного в значении элемента.<br><br>Если элемент является изменяемым, его значение должно быть доступно для редактирования пользователем. Пользовательские агенты могут изменять интервалы и, при необходимости, пунктуацию значений, которые вводит пользователь. Пользовательские агенты не должны позволять пользователям вставлять символы U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR) в значение элемента.<br><br>Атрибут value, если он указан, должен иметь значение, не содержащее символов U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR).<br><br>Алгоритм очистки значения следующий: удалите из значения символы новой строки.</p><br><form><input type='tel'></form>'",
   "inputEmail": "<h3>Type='email'</h3><br><p>Если атрибут типа входного элемента находится в состоянии «Электронная почта», применяются правила, описанные в этом разделе.<br><br>Как работает состояние электронной почты, зависит от того, указан ли атрибут Multiple или нет.<br><br>Если для элемента не указан атрибут Multiple Элемент ввода представляет собой элемент управления для редактирования адреса электронной почты, указанного в значении элемента.<br><br>Если элемент является изменяемым, пользовательский агент должен разрешить пользователю изменять адрес электронной почты, представленный его значением. Пользовательские агенты могут разрешить пользователю устанавливать значение строки, которая не является действительным адресом электронной почты. Пользовательский агент должен действовать таким образом, чтобы ожидать, что пользователь предоставит один адрес электронной почты. Пользовательские агенты должны позволять пользователю устанавливать значение пустой строки. Пользовательские агенты не должны позволять пользователям вставлять в значение символы U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR). Пользовательские агенты могут преобразовывать значение для отображения и редактирования; в частности, пользовательские агенты должны преобразовывать punycode в метках домена значения в IDN при отображении и наоборот.<br><br>Проверка ограничений: хотя пользовательский интерфейс представляет входные данные, которые пользовательский агент не может преобразовать в Punycode, элемент управления страдает от неправильных входных данных.<br><br>Атрибут value, если он указан и не пуст, должен иметь значение, представляющее собой один действительный адрес электронной почты.<br><br>Алгоритм очистки значения следующий: удалите из значения символы новой строки, затем удалите из значения начальные и конечные пробелы ASCII.<br><br>Проверка ограничения: хотя значение элемента не является ни пустой строкой, ни единственным действительным адресом электронной почты, элемент страдает от несоответствия типов.<br><br>Когда для элемента указан атрибут Multiple Элемент ввода представляет собой элемент управления для добавления, удаления и редактирования адресов электронной почты, указанных в значениях элемента.<br><br>Если элемент является изменяемым, пользовательский агент должен позволять пользователю добавлять, удалять и редактировать адреса электронной почты, представленные его значениями. Пользовательские агенты могут разрешить пользователю устанавливать любое отдельное значение в списке значений в строку, которая не является действительным адресом электронной почты, но не должны позволять пользователям устанавливать любое индивидуальное значение в строку, содержащую U+002C ЗАПЯТАЯ (,), U Символы +000A ПЕРЕВОД СТРОКИ (LF) или U+000D ВОЗВРАТ КАРЕТКИ (CR). Пользовательские агенты должны позволять пользователю удалять все адреса в значениях элемента. Пользовательские агенты могут преобразовывать значения для отображения и редактирования; в частности, пользовательские агенты должны преобразовывать punycode в метках домена значения в IDN при отображении и наоборот.<br><br>Проверка ограничений: хотя пользовательский интерфейс описывает ситуацию, когда отдельное значение содержит запятую U+002C (,) или представляет ввод, который пользовательский агент не может преобразовать в punycode, элемент управления страдает от неправильного ввода.<br><br>Всякий раз, когда пользователь меняет значения элемента, пользовательский агент должен выполнить следующие шаги:</p><br><br><ul><li>Пусть последние значения будут копией значений элемента.</li><li>Удалите начальные и конечные пробелы ASCII из каждого значения в последних значениях.</li><li>Пусть значение элемента является результатом объединения всех значений в последних значениях, отделяя каждое значение от следующего одним символом ЗАПЯТАЯ U+002C (,), сохраняя порядок списка.</li></ul><br><br><form><input type='email'></form>",
   "inputPassword": "<h3>Type='password'</h3><br><p>Если атрибут типа входного элемента находится в состоянии «Пароль», применяются правила, описанные в этом разделе.<br><br>Элемент ввода представляет собой однострочный элемент управления простым текстом для редактирования значения элемента. Пользовательский агент должен скрывать значение, чтобы его не могли видеть другие люди, кроме пользователя.<br><br>Если элемент является изменяемым, его значение должно быть доступно для редактирования пользователем. Пользовательские агенты не должны позволять пользователям вставлять в значение символы U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR).<br><br>Атрибут value, если он указан, должен иметь значение, не содержащее символов U+000A LINE FEED (LF) или U+000D CARRIAGE RETURN (CR).<br><br>Алгоритм очистки значения следующий: удалите из значения символы новой строки.</p><br><form><input type='password'></form>",
   "inputDate": "<h3>Type='date'</h3><br><p>Когда атрибут type входного элемента находится в состоянии Date, применяются правила этого раздела.<br><br>Элемент ввода представляет собой элемент управления для установки значения элемента в строку, представляющую определенную дату.<br><br>Если элемент является изменяемым, пользовательский агент должен разрешить пользователю изменять дату, представленную его значением, полученным путем анализа даты из него. Пользовательские агенты не должны позволять пользователю устанавливать значение непустой строки, которая не является допустимой строкой даты. Если пользовательский агент предоставляет пользовательский интерфейс для выбора даты, то значение должно быть установлено в действительную строку даты, представляющую выбор пользователя. Пользовательские агенты должны позволять пользователю устанавливать значение пустой строки.<br><br>Проверка ограничений: хотя пользовательский интерфейс описывает входные данные, которые пользовательский агент не может преобразовать в действительную строку даты, элемент управления страдает от неверных входных данных.</p><br><form><input type='date'></form>",
   "inputMonth": "<h3>Type='month'</h3><br><p>Если атрибут типа входного элемента находится в состоянии «Месяц», применяются правила, описанные в этом разделе.<br><br>Элемент ввода представляет собой элемент управления для установки значения элемента в строку, представляющую определенный месяц.<br><br>Если элемент является изменяемым, пользовательский агент должен разрешить пользователю изменять месяц, представленный его значением, полученным путем анализа месяца из него. Пользовательские агенты не должны позволять пользователю устанавливать значение в непустую строку, которая не является допустимой строкой месяца. Если пользовательский агент предоставляет пользовательский интерфейс для выбора месяца, то значение должно быть установлено в действительную строку месяца, представляющую выбор пользователя. Пользовательские агенты должны позволять пользователю устанавливать значение пустой строки.<br><br>Проверка ограничений: хотя пользовательский интерфейс описывает входные данные, которые пользовательский агент не может преобразовать в допустимую строку месяца, элемент управления страдает от неверных входных данных.</p><br><form><input type='month'></form>",
   "inputWeek": "<h3>Type='week'</h3><br><p>Если атрибут типа входного элемента находится в состоянии «Неделя», применяются правила, описанные в этом разделе.<br><br>Элемент ввода представляет собой элемент управления для установки значения элемента в строку, представляющую определенную неделю.<br><br>Если элемент является изменяемым, пользовательский агент должен разрешить пользователю изменять неделю, представленную его значением, полученным путем анализа недели из него. Пользовательские агенты не должны позволять пользователю устанавливать значение в непустую строку, которая не является допустимой строкой недели. Если пользовательский агент предоставляет пользовательский интерфейс для выбора недели, то значение должно быть установлено в действительную строку недели, представляющую выбор пользователя. Пользовательские агенты должны позволять пользователю устанавливать значение пустой строки.<br><br>Проверка ограничений: хотя пользовательский интерфейс описывает входные данные, которые пользовательский агент не может преобразовать в действительную строку недели, элемент управления страдает от неверных входных данных.</p><br><form><input type='week'></form>",
   "inputTime": "<h3>Type='time'</h3><br><p>Когда атрибут type входного элемента находится в состоянии Time, применяются правила этого раздела.<br><br>Элемент ввода представляет собой элемент управления для установки значения элемента в строку, представляющую определенное время.<br><br>Если элемент является изменяемым, пользовательский агент должен позволять пользователю изменять время, представленное его значением, полученным путем анализа времени из него. Пользовательские агенты не должны позволять пользователю устанавливать значение непустой строки, которая не является допустимой строкой времени. Если пользовательский агент предоставляет пользовательский интерфейс для выбора времени, то значение должно быть установлено в действительную строку времени, представляющую выбор пользователя. Пользовательские агенты должны позволять пользователю устанавливать значение пустой строки.<br><br>Проверка ограничений: хотя пользовательский интерфейс описывает входные данные, которые пользовательский агент не может преобразовать в допустимую строку времени, элемент управления страдает от неверных входных данных.</p><br><form><input type='time'></form>",
   "inputDateTime-Local": "<h3>Type='datetime-local'</h3><br><p>Если атрибут типа входного элемента находится в состоянии «Локальная дата и время», применяются правила, описанные в этом разделе.<br><br>Элемент ввода представляет собой элемент управления для установки значения элемента в строку, представляющую местную дату и время, без информации о смещении часового пояса.<br><br>Если элемент является изменяемым, пользовательский агент должен разрешить пользователю изменять дату и время, представленные его значением, полученным путем анализа даты и времени из него. Пользовательские агенты не должны позволять пользователю устанавливать значение в непустую строку, которая не является допустимой нормализованной строкой локальной даты и времени. Если пользовательский агент предоставляет пользовательский интерфейс для выбора локальной даты и времени, то значение должно быть установлено в действительную нормализованную строку локальной даты и времени, представляющую выбор пользователя. Пользовательские агенты должны позволять пользователю устанавливать значение пустой строки.<br><br>Проверка ограничений: хотя пользовательский интерфейс описывает входные данные, которые пользовательский агент не может преобразовать в действительную нормализованную строку локальной даты и времени, элемент управления страдает от неверных входных данных.</p><br><form><input type='datetime-local'></form>",
   "inputNumber": "<h3>Type='number'</h3><br><p>Когда атрибут type входного элемента находится в состоянии Number, применяются правила этого раздела.<br><br>Элемент ввода представляет собой элемент управления для установки значения элемента в строку, представляющую число.<br><br>Если элемент является изменяемым, пользовательский агент должен позволять пользователю изменять число, представленное его значением, полученным в результате применения к нему правил анализа значений чисел с плавающей запятой. Пользовательские агенты не должны позволять пользователю устанавливать значение в непустую строку, которая не является допустимым числом с плавающей запятой. Если пользовательский агент предоставляет пользовательский интерфейс для выбора числа, то значение должно быть установлено в наилучшее представление числа, представляющего выбор пользователя в виде числа с плавающей запятой. Пользовательские агенты должны позволять пользователю устанавливать значение пустой строки.<br><br>Проверка ограничений: хотя пользовательский интерфейс описывает входные данные, которые пользовательский агент не может преобразовать в допустимое число с плавающей запятой, элемент управления страдает от неверных входных данных.</p><br><form><input type='number'></form>",
   "inputRange": "<h3>Type='range'</h3><br><p>Когда атрибут type входного элемента находится в состоянии Range, применяются правила этого раздела.<br><br>Элемент input представляет собой элемент управления для установки значения элемента в строку, представляющую число, но с оговоркой, что точное значение не важно, что позволяет UA предоставлять более простой интерфейс, чем для состояния Number.<br><br>Если элемент является изменяемым, пользовательский агент должен позволять пользователю изменять число, представленное его значением, полученным в результате применения к нему правил анализа значений чисел с плавающей запятой. Пользовательские агенты не должны позволять пользователю устанавливать значение в строку, которая не является допустимым числом с плавающей запятой. Если пользовательский агент предоставляет пользовательский интерфейс для выбора числа, то значение должно быть установлено в наилучшее представление числа, представляющего выбор пользователя в виде числа с плавающей запятой. Пользовательские агенты не должны позволять пользователю устанавливать значение пустой строки.<br><br>Проверка ограничений: хотя пользовательский интерфейс описывает входные данные, которые пользовательский агент не может преобразовать в допустимое число с плавающей запятой, элемент управления страдает от неверных входных данных.<br><br>Атрибут value, если он указан, должен иметь значение, которое является допустимым числом с плавающей запятой.<br><br>Алгоритм очистки значения следующий: если значение элемента не является допустимым числом с плавающей запятой, установите для него наилучшее представление значения по умолчанию в виде числа с плавающей запятой.<br><br>Значением по умолчанию является минимум плюс половина разницы между минимумом и максимумом, если только максимум не меньше минимума, в этом случае значением по умолчанию является минимум.</p><br><form><input type='range'></form>",
   "inputColor": "<h3>Type='color'</h3><br><p>Когда атрибут типа входного элемента находится в состоянии «Цвет», применяются правила, описанные в этом разделе.<br><br>Элемент ввода представляет собой элемент управления цветовой областью для установки значения элемента в строку, представляющую простой цвет.<br><br>Если элемент является изменяемым, пользовательский агент должен позволять пользователю изменять цвет, представленный его значением, полученным в результате применения к нему правил анализа простых значений цвета. Пользовательские агенты не должны позволять пользователю устанавливать значение в строку, которая не является допустимым простым цветом в нижнем регистре. Если пользовательский агент предоставляет пользовательский интерфейс для выбора цвета, то значение должно быть установлено в результате использования правил сериализации простых значений цвета по выбору пользователя. Пользовательские агенты не должны позволять пользователю устанавливать значение пустой строки.</p><br><form><input type='color'></form>",
   "inputRadio": "<h3>Type='radio'</h3><br><p>Когда атрибут типа входного элемента находится в состоянии переключателя, применяются правила, описанные в этом разделе.<br><br>Элемент ввода представляет собой элемент управления, который при использовании вместе с другими элементами ввода образует группу переключателей, в которой только для одного элемента управления состояние проверки может быть установлено в значение true. Если состояние проверенности элемента истинно, элемент управления представляет выбранный элемент управления в группе, а если оно имеет значение false, оно указывает на элемент управления в группе, который не выбран.<br><br>Группа переключателей, содержащая элемент ввода a, также содержит все остальные элементы ввода b, которые удовлетворяют всем следующим условиям:</p><br><br><ul><li>Атрибут типа входного элемента b находится в состоянии переключателя.</li><li>Либо a и b имеют одного и того же владельца формы, либо у них обоих нет владельца формы.</li><li>И a, и b находятся в одном дереве.</li><li>У них обоих есть атрибут имени, их атрибуты имени не пусты, а значение атрибута имени a равно значению атрибута имени b.</li></ul><br><br><p>Дерево не должно содержать входной элемент, группа переключателей которого содержит только этот элемент.</p><br><form><input type='radio'></form>",
   "inputCheckBox": "<h3>Type='checkbox'</h3><br><p>Когда атрибут type входного элемента находится в состоянии Checkbox, применяются правила этого раздела.<br><br>Элемент ввода представляет собой элемент управления с двумя состояниями, который представляет состояние проверки элемента. Если состояние проверенности элемента истинно, элемент управления представляет положительный выбор, а если оно ложно, отрицательный выбор. Если для неопределенного IDL-атрибута элемента установлено значение true, то выбор элемента управления должен быть скрыт, как если бы элемент управления находился в третьем, неопределенном состоянии.<br><br>Поведение активации ввода заключается в выполнении следующих шагов:</p><br><br><ul><li>Если элемент не подключен, то возврат.</li><li>Запустите событие с именем input в элементе с пузырьками и составными атрибутами, инициализированными значением true.</li><li>Запустите событие с именем изменения в элементе с атрибутом пузырьков, инициализированным значением true.</li></ul><br><br><p>Проверка ограничений: если элемент обязателен и его проверенность ложна, значит, элемент отсутствует.</p><br><form><input type='checkbox'></form>",
   "inputFile": "<h3>Type='file'</h3><br><p>Когда атрибут типа входного элемента находится в состоянии загрузки файла, применяются правила, описанные в этом разделе.<br><br>Элемент ввода представляет собой список выбранных файлов, каждый файл состоит из имени файла, типа файла и тела файла (содержимого файла).<br><br>Имена файлов не должны содержать компоненты пути, даже если пользователь выбрал всю иерархию каталогов или несколько файлов с одинаковым именем из разных каталогов. Компоненты пути для состояния загрузки файла — это те части имен файлов, которые разделены символами U+005C REVERSE SOLIDUS.<br><br>Если атрибут Multiple не установлен, в списке выбранных файлов не должно быть более одного файла.<br><br>Поведение активации ввода для такого элемента element заключается в отображении средства выбора, если применимо, для элемента.<br><br>Если элемент является изменяемым, пользовательский агент должен позволять пользователю изменять файлы в списке и другими способами, например, добавляя или удаляя файлы путем перетаскивания. Когда пользователь это делает, пользовательский агент должен обновить выбор файла для элемента.<br><br>Если элемент не является изменяемым, пользовательский агент не должен позволять пользователю изменять выбор элемента.</p><br><form><input type='file'></form>",
   "inputSubmit": "<h3>Type='submit'</h3><br><p>Когда атрибут type элемента ввода находится в состоянии «Кнопка отправки», применяются правила, описанные в этом разделе.<br><br>(Это вектор отслеживания.) Элемент ввода представляет собой кнопку, которая при активации отправляет форму. Если элемент имеет атрибут value, метка кнопки должна быть значением этого атрибута; в противном случае это должна быть строка, определенная реализацией, которая означает «Отправить» или что-то в этом роде. Элемент представляет собой кнопку, а именно кнопку отправки.<br><br>Поскольку метка по умолчанию определяется реализацией, а ширина кнопки обычно зависит от метки кнопки, ширина кнопки может привести к утечке нескольких битов информации, позволяющей отпечатки пальцев. Эти биты, вероятно, будут сильно коррелировать с личностью пользовательского агента и языковым стандартом пользователя.</p><br><form><input type='submit'></form>",
   "inputImage": "<h3>Type='image'</h3><br><p>Когда атрибут типа входного элемента находится в состоянии «Кнопка изображения», применяются правила, описанные в этом разделе.<br><br>Элемент ввода представляет собой либо изображение, из которого пользователь может выбрать координату и отправить форму, либо, альтернативно, кнопку, с помощью которой пользователь может отправить форму. Элемент представляет собой кнопку, а именно кнопку отправки.<br><br>Изображение задается атрибутом src. Атрибут src должен присутствовать и содержать допустимый непустой URL-адрес, потенциально окруженный пробелами, ссылающийся на неинтерактивный, опционально анимированный ресурс изображения, который не является ни страничным, ни сценарным.<br><br>Когда происходит любое из этих событий</p><br><br><ul><li>атрибут type входного элемента сначала устанавливается в состояние кнопки изображения (возможно, при первом создании элемента), и присутствует атрибут src</li><li>атрибут типа входного элемента снова изменяется на состояние кнопки изображения, а атрибут src присутствует, и его значение изменилось с тех пор, как атрибут типа в последний раз находился в состоянии кнопки изображения.</li><li>атрибут типа входного элемента находится в состоянии кнопки изображения, а атрибут src установлен или изменен</li></ul><br><form><input type='image'></form>",
   "inputReset": "<h3>Type='reset'</h3><br><p>Когда атрибут типа входного элемента находится в состоянии «Кнопка сброса», применяются правила, описанные в этом разделе.<br><br>(Это вектор отслеживания.) Элемент ввода представляет собой кнопку, которая при активации сбрасывает форму. Если элемент имеет атрибут value, метка кнопки должна быть значением этого атрибута; в противном случае это должна быть строка, определенная реализацией, которая означает «Сброс» или что-то в этом роде. Элемент представляет собой кнопку.<br><br>Поскольку метка по умолчанию определяется реализацией, а ширина кнопки обычно зависит от метки кнопки, ширина кнопки может привести к утечке нескольких битов информации, позволяющей отпечатки пальцев. Эти биты, вероятно, будут сильно коррелировать с идентификацией пользовательского агента и языковым стандартом пользователя.<br><br>Поведение активации ввода элемента следующее:</p><br><br><ul><li>Если у элемента нет владельца формы, вернитесь.</li><li>Если документ узла элемента не полностью активен, вернитесь.</li><li>Сброс владельца формы из элемента.</li></ul><br><br><p>Проверка ограничений: элементу запрещена проверка ограничений.</p><br><form><input type='reset'></form>",
   "inputButton": "<h3>Type='button'</h3><br><p>Когда атрибут типа элемента ввода находится в состоянии «Кнопка», применяются правила, описанные в этом разделе.<br><br>Элемент ввода представляет собой кнопку без поведения по умолчанию. В атрибуте value должна быть указана метка кнопки, хотя это может быть пустая строка. Если элемент имеет атрибут value, метка кнопки должна быть значением этого атрибута; в противном случае это должна быть пустая строка. Элемент представляет собой кнопку.<br><br>Элемент не имеет поведения активации ввода.<br><br>Проверка ограничений: элементу запрещена проверка ограничений.</p><br><form><input type='button'></form>",
   "button": "<h3>Button</h3><br><p>Элемент button представляет собой кнопку, помеченную ее содержимым.<br><br>Элемент представляет собой кнопку.</p><br><form><button>Кнопка</button></form>",
   "select": "<h3>Select</h3><br><p>Элемент select представляет собой элемент управления для выбора среди набора опций.<br><br>Атрибут Multiple является логическим атрибутом. Если атрибут присутствует, то элемент выбора представляет собой элемент управления для выбора нуля или более параметров из списка параметров. Если атрибут отсутствует, то элемент выбора представляет собой элемент управления для выбора одной опции из списка опций.<br><br>Атрибут размера указывает количество опций, которые будут отображаться пользователю. Атрибут размера, если он указан, должен иметь значение, которое является допустимым неотрицательным целым числом, большим нуля.<br><br>Размер отображения выбранного элемента является результатом применения правил анализа неотрицательных целых чисел к значению атрибута размера элемента, если он имеется, и его анализ прошел успешно. Если применение этих правил к значению атрибута не удалось или если атрибут размера отсутствует, то размер отображения элемента равен 4, если у элемента присутствует атрибут множественного содержимого, и 1 в противном случае.<br><br>Список опций для элемента select состоит из всех дочерних элементов option элемента select и всех дочерних элементов option всех дочерних элементов optgroup элемента select в древовидном порядке.<br><br>Обязательный атрибут является логическим атрибутом. Если этот параметр указан, пользователю необходимо будет выбрать значение перед отправкой формы.<br><br>Если для элемента select указан обязательный атрибут, не указан множественный атрибут и размер отображения равен 1; и если значением первого элемента option в списке опций элемента select (если таковой имеется) является пустая строка, а родительским узлом этого элемента option является элемент select (а не элемент optgroup), то эта опция является элементом select опция метки-заполнителя.<br><br>Если для элемента select указан обязательный атрибут, не указан множественный атрибут и размер отображения равен 1, то элемент select должен иметь опцию метки-заполнителя.</p><br><form><select><option>Miner</option><option> Puffer </option></select></form>",
   "datalist": "<h3>Datalist</h3><br><p>Элемент datalist представляет собой набор элементов option, которые представляют предопределенные параметры для других элементов управления. При рендеринге элемент списка данных ничего не представляет, и его вместе со своими дочерними элементами следует скрыть.<br><br>Элемент datalist можно использовать двумя способами. В простейшем случае элемент datalist имеет только дочерние элементы option.</p><br><form><label>Animal:<input name=animal list=animals><datalist id=animals><option value='Cat'><option value='Dog'></datalist></label></form>",
   "optgroup": "<h3>Optgroup</h3><br><p>Элемент optgroup представляет группу элементов option с общей меткой.<br><br>Группа элементов option элемента состоит из элементов option, которые являются дочерними элементами элемента optgroup.<br><br>При отображении элементов опций в элементах выбора пользовательские агенты должны показывать элементы опций таких групп как связанные друг с другом и отдельно от других элементов опций.<br><br>Атрибут Disabled является логическим атрибутом и может использоваться для одновременного отключения группы элементов опций.<br><br>Атрибут метки должен быть указан. Его значение дает имя группы для пользовательского интерфейса. Пользовательские агенты должны использовать значение этого атрибута при маркировке группы элементов option в элементе select.<br><br>Атрибуты Disabled и Label должны отражать соответствующие атрибуты контента с тем же именем.</p>",
   "option": "<h3>Option</h3><br><p>Элемент option представляет собой опцию в элементе select или как часть списка предложений в элементе списка данных.<br><br>В определенных обстоятельствах, описанных в определении элемента select, элемент option может быть опцией метки-заполнителя элемента select. Параметр метки-заполнителя не представляет собой фактический параметр, а вместо этого представляет собой метку для элемента управления выбора.<br><br>Атрибут Disabled является логическим атрибутом. Элемент option отключается, если присутствует его атрибут Disable или если он является дочерним элементом элемента optgroup, у которого присутствует атрибут Disable.<br><br>Отключенный элемент опции должен предотвращать отправку на элемент любых событий щелчка, поставленных в очередь в источнике задачи взаимодействия с пользователем.<br><br>Атрибут label предоставляет метку для элемента. Меткой элемента option является значение атрибута содержимого метки, если он имеется и его значение не является пустой строкой, или, в противном случае, значением текстового IDL-атрибута элемента.<br><br>Атрибут содержимого метки, если он указан, не должен быть пустым.<br><br>Атрибут value предоставляет значение для элемента. Значением элемента option является значение атрибута содержимого value, если он есть, или, если его нет, значение текстового IDL-атрибута элемента.<br><br>Выбранный атрибут является логическим атрибутом. Он представляет выбранность элемента по умолчанию.<br><br>Загрязнение элемента option — это логическое состояние, изначально ложное. Он контролирует, будет ли добавление или удаление выбранного атрибута контента иметь какой-либо эффект.<br><br>Выбранность элемента option представляет собой логическое состояние, изначально ложное. Если не указано иное, при создании элемента для его выбранности должно быть установлено значение true, если элемент имеет выбранный атрибут. Всякий раз, когда добавляется атрибут selected элемента option, если его загрязненность имеет значение false, для его выбранности должно быть установлено значение true. Всякий раз, когда атрибут selected элемента option удаляется, если его загрязненность имеет значение false, его выбранность должна быть установлена на false.</p><br><form><select><option>Miner</option><option> Puffer </option></select></form>",
   "textarea": "<h3>Textarea</h3><br><p>Элемент textarea представляет собой многострочный элемент управления простым текстом для редактирования необработанного значения элемента. Содержимое элемента управления представляет значение элемента управления по умолчанию.<br><br>Необработанное значение элемента управления textarea изначально должно быть пустой строкой.<br><br>К этому элементу предъявляются требования к рендерингу, включающие двунаправленный алгоритм.<br><br>Атрибут readonly — это логический атрибут, используемый для управления тем, может ли текст редактироваться пользователем или нет.</p><br><form><textarea></textarea></form>",
   "progress": "<h3>Progress</h3><br><p>Элемент прогресса представляет ход выполнения задачи. Ход выполнения либо неопределенен, что указывает на то, что прогресс достигается, но неясно, сколько еще работы осталось сделать, прежде чем задача будет завершена (например, потому что задача ожидает ответа от удаленного хоста), либо прогресс неопределенен. число в диапазоне от нуля до максимума, обозначающее долю работы, которая к настоящему моменту завершена.<br><br>Есть два атрибута, которые определяют текущее завершение задачи, представленное элементом. Атрибут value указывает, какая часть задачи была выполнена, а атрибут max указывает, сколько работы в целом требуется для выполнения задачи. Единицы произвольны и не указаны.</p><br><section><h2>Task Progress</h2><p>Progress: <progress id='p' max=100><span>0</span>%</progress></p></section>",
   "meter": "<h3>Meter</h3><br><p>Элемент счетчика представляет собой скалярное измерение в известном диапазоне или дробное значение; например, использование диска, релевантность результата запроса или доля голосующего населения, выбравшая конкретного кандидата.<br><br>Это также известно как датчик.<br><br>Элемент счетчика не следует использовать для обозначения прогресса (как в индикаторе выполнения). Для этой роли HTML предоставляет отдельный элемент прогресса.<br><br>Элемент счетчика также не представляет собой скалярное значение произвольного диапазона — например, было бы неправильно использовать его для сообщения о весе или росте, если не известно максимальное значение.<br><br>Существует шесть атрибутов, определяющих семантику датчика, представленного элементом.<br><br>Атрибут min указывает нижнюю границу диапазона, а атрибут max — верхнюю границу. Атрибут value определяет значение, которое датчик будет указывать как «измеренное» значение.<br><br>Остальные три атрибута можно использовать для разделения диапазона датчика на «низкую», «среднюю» и «высокую» части, а также для указания того, какая часть датчика является «оптимальной». Атрибут low указывает диапазон, который считается «низкой» частью, а атрибут high указывает диапазон, который считается «высокой» частью. Атрибут оптимальности дает положение, которое является «оптимальным»; если оно выше «высокого» значения, то это означает, что чем выше значение, тем лучше; если оно ниже отметки «низкий», то это указывает на то, что более низкие значения лучше, и, естественно, если оно находится между ними, это означает, что ни высокие, ни низкие значения не являются хорошими.<br><br>Требования к авторству: необходимо указать атрибут value. Атрибуты value, min, low, high, max иOptimum, если они присутствуют, должны иметь значения, которые являются допустимыми числами с плавающей запятой.</p>",
   "fieldset": "<h3>Fieldset</h3><br><p>Элемент fieldset представляет собой набор элементов управления формы (или другого содержимого), сгруппированных вместе, при необходимости с заголовком. Заголовок задается первым элементом легенды, который является дочерним элементом элемента fieldset, если таковой имеется. Остальные потомки образуют группу.<br><br>Атрибут Disabled, если он указан, приводит к отключению всех потомков элемента управления формой элемента fieldset, за исключением тех, которые являются потомками первого дочернего элемента легенды элемента fieldset, если таковой имеется.<br><br>Элемент набора полей является отключенным набором полей, если он соответствует любому из следующих условий:</p><br><br><ul><li>Его отключенный атрибут указан</li><li>Он является потомком другого элемента набора полей, для которого указан отключенный атрибут, и не является потомком первого дочернего элемента легенды этого элемента набора полей, если таковой имеется</li></ul><br><br><p>Атрибут формы используется для явного связывания элемента набора полей с его владельцем формы. Атрибут name представляет имя элемента.</p>",
   "script": "<h3>Script</h3><br><p></p>",
   "noscript": "<h3>Noscript</h3><br><p></p>",
   "template": "<h3>Template</h3><br><p></p>",
   "slot": "<h3>Slot</h3><br><p></p>",
   "canvas": "<h3>Canvas</h3><br><p></p>",
   "details": "<h3>Details</h3><br><p></p>",
   "summary": "<h3>Summary</h3><br><p></p>",
   "dialog": "<h3>Dialog</h3><br><p></p>",
   "legend": "<h3>Legend</h3><br><p>Элемент легенды представляет собой заголовок для остального содержимого родительского элемента набора полей элемента легенды, если таковой имеется.<br><br>Поведение атрибута IDL формы зависит от того, находится ли элемент легенды в элементе набора полей или нет. Если легенда имеет элемент набора полей в качестве родителя, то атрибут IDL формы должен возвращать то же значение, что и атрибут IDL формы в этом элементе набора полей. В противном случае он должен вернуть ноль.</p>"
}